lab11_ci/ci4/app/Controllers/api/Auth.php

public function login()
    {
        try {
            // Tangkap data dengan cara yang lebih aman
            $username = $this->request->getVar('username');
            $password = $this->request->getVar('password');

            // Cek apakah data dikirim via JSON (Axios)
            $json = $this->request->getJSON();
            if ($json) {
                $username = $json->username ?? $username;
                $password = $json->password ?? $password;
            }

            if (empty($username) || empty($password)) {
                return $this->failUnauthorized('Username atau Password tidak boleh kosong.');
            }

            $model = new \App\Models\UserModel();

            $user = $model->where('username', $username)
                          ->orWhere('useremail', $username)
                          ->first();
---
SELECT *
FROM `user`
WHERE `username` = 'admin@email.com'
OR `useremail` = 'admin@email.com'
 LIMIT 1