lab11_ci/ci4/app/Controllers/Post.php

SELECT *
FROM `artikel`
ORDER BY `id` DESC
---
    public function index()
    {
        $model = new ArtikelModel();
        // Mengambil semua data artikel diurutkan dari yang terbaru
        $data['artikel'] = $model->orderBy('id', 'DESC')->findAll();

INSERT INTO `artikel` (`judul`, `isi`, `id_kategori`) VALUES ('Seorang bapak-bapak tertabrak odong-odong', 'Dini hari seorang bapak-bapak mengalami kejadian......', 1)
---
    public function create()
    {
        $model = new ArtikelModel();
        $data = [
            'judul'       => $this->request->getVar('judul'),
            'isi'         => $this->request->getVar('isi'),
            // Kita set id_kategori default ke 1 kalo kosong, biar ga nabrak database lu
            'id_kategori' => $this->request->getVar('id_kategori') ?? 1
        ];

        $model->insert($data);

SELECT *
FROM `artikel`
WHERE `id` = '26'
 LIMIT 1
DELETE FROM `artikel`
WHERE `id` IN ('26')
---
    public function delete($id = null)
    {
        $model = new ArtikelModel();
        $data = $model->where('id', $id)->first();

        if ($data) {
            $model->delete($id);